{
  "backend/main.mo": "Backend actor managing entries with admin-restricted CRUD, publishing, and querying by section or search.",
  "feature_evidence.json": "Report mapping requested features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries describing the purpose of each major frontend file.",
  "frontend/index.css": "Tailwind CSS setup defining global OKLCH color variables and base styling for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the root div and main React script.",
  "frontend/src/App.tsx": "Defines the full TanStack Router configuration including new Introduction route and admin-protected routes.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component enforcing authentication and admin access, showing alerts when blocked.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity and clearing React Query cache on logout.",
  "frontend/src/components/content/EntryList.tsx": "Displays a grid of entry cards with title, date, excerpt, and tags, linking to individual entry pages. Handles empty states and formats timestamps.",
  "frontend/src/components/content/Prose.tsx": "Wrapper component applying consistent typography and styling to prose content. Accepts children and optional custom classes.",
  "frontend/src/components/feedback/QueryState.tsx": "Provides loading skeletons, error alerts, and empty-state messaging for data-fetching components. Renders appropriate UI based on query status flags.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with navigation links, copyright info, and a caffeine.ai attribution link. Computes current year and hostname dynamically.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the main site header with navigation, search, login, and mobile menu. Supports admin link visibility based on identity and authorization hooks.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout component arranging header, main content, and footer. Ensures full-height page structure.",
  "frontend/src/hooks/queryKeys.ts": "Defines centralized React Query keys for entries, search, auth, and works. Provides helpers for parameterized keys.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, initializing access control as needed. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminEntries.ts": "Provides mutations for creating, updating, deleting, and publishing entries via the backend actor. Invalidates relevant entry queries and displays toast notifications.",
  "frontend/src/hooks/useAdminWorks.ts": "Provides queries and mutations for managing works, including listing, creating, updating, deleting, and publishing. Handles sorting, cache invalidation, and error toasts.",
  "frontend/src/hooks/useAuthz.ts": "Queries whether the current caller is an admin using the backend actor. Enabled only when an actor is available.",
  "frontend/src/hooks/useEntries.ts": "Fetches published entries by section and retrieves single entry details. Uses backend actor and sorts lists by creation time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, stored identity loading, and login status states.",
  "frontend/src/hooks/useSearch.ts": "Defines a search hook that queries entries by term and optional section, returning sorted results via React Query.",
  "frontend/src/hooks/useWorks.ts": "Adds hooks for fetching published works or a specific work using React Query and an actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme color variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the veridoxa platform and its mission.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing entries across sections, including editing, publishing, and deleting.",
  "frontend/src/pages/admin/AdminEditorPage.tsx": "Form for creating or editing an entry, handling section, metadata, and submission logic.",
  "frontend/src/pages/admin/AdminWorksPage.tsx": "Admin listing of all works with publish toggles, deletion, and navigation to upload or edit pages.",
  "frontend/src/pages/admin/AdminWorkUploadPage.tsx": "Interface for uploading a new work file with progress tracking and metadata input.",
  "frontend/src/pages/EntryDetailPage.tsx": "Displays a single entry with title, date, tags, and formatted body, handling loading and navigation.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with section cards linking to research, storytelling, and poetry content.",
  "frontend/src/pages/IntroductionPage.tsx": "Static introduction page presenting the author's background and published works.",
  "frontend/src/pages/SearchPage.tsx": "Implements a searchable interface for entries with optional section filtering and result listing.",
  "frontend/src/pages/SectionListPage.tsx": "Displays entries for a specific section with optional tag filtering and list rendering.",
  "frontend/src/pages/WorkDetailPage.tsx": "Displays a single work’s details, offering PDF viewing and download with loading and error handling.",
  "frontend/src/pages/WorksListPage.tsx": "Lists published works with metadata and provides view or download actions depending on file type.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, components, and enabled plugins for styling.",
  "project_state.json": "Project metadata describing the site's goals, features, architecture notes, and known issues for the veridoxa build."
}