{
  "backend/main.mo": "Defines the main actor with access control, user profiles, and admin‑restricted CRUD operations for content entries using Maps and mixins.",
  "backend/migration.mo": "Provides a no‑op migration module that maps old actor state structures directly to the new format.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files and components for updating admin works data fetching.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and applying base body styling.",
  "frontend/index.html": "Basic HTML template that mounts the React app at the root element and loads main.tsx.",
  "frontend/src/App.tsx": "Configures the full TanStack Router route tree, global layout, theming, and admin‑guarded admin routes.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard that checks identity and admin status, showing tailored alerts for missing login, incomplete setup, or insufficient privileges.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with React Query cache clearing and error handling for already‑authenticated states.",
  "frontend/src/components/content/EntryList.tsx": "Displays a grid of entry cards with titles, dates, excerpts, and tags, linking to detailed views. Handles empty states and formats timestamps.",
  "frontend/src/components/content/Prose.tsx": "Wraps content with standardized prose styling using utility classes and optional extra class names.",
  "frontend/src/components/feedback/QueryState.tsx": "Provides loading skeletons, error alerts, and empty-state messaging for query-driven components.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with navigation links, copyright text, and a powered-by attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the main site header with navigation, search, login, mobile menu, and optional admin link logic.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the page layout structure including header, footer, and main content wrapper.",
  "frontend/src/hooks/queryKeys.ts": "Centralizes React Query cache keys for entries, search, auth, and works.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminEntries.ts": "Provides mutations for creating, updating, deleting, and publishing entries with query invalidation and toast feedback.",
  "frontend/src/hooks/useAdminWorks.ts": "Supplies admin-focused queries and mutations for managing works, including upload, update, delete, and publish actions.",
  "frontend/src/hooks/useAuthz.ts": "Checks whether the current caller is an admin using the backend actor and exposes related status flags.",
  "frontend/src/hooks/useEntries.ts": "Provides React Query hooks to fetch published entries by section and individual entries via an actor, with sorting and conditional enabling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider that manages identities, login flow, and AuthClient initialization.",
  "frontend/src/hooks/useRobustActor.ts": "Creates and maintains a backend actor tied to the user's identity, handling admin token setup and auto‑invalidating dependent queries.",
  "frontend/src/hooks/useSearch.ts": "Supplies a search hook that queries entries by term, optionally filters by section, and sorts results by creation date.",
  "frontend/src/hooks/useWorks.ts": "Provides hooks to fetch published works and individual work details through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm light/dark theme palette using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the platform’s mission and content sections.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard listing entries by section with controls to edit, publish/unpublish, and delete entries.",
  "frontend/src/pages/admin/AdminEditorPage.tsx": "Admin form for creating or editing an entry, handling sections, text fields, tags, and admin access validation.",
  "frontend/src/pages/admin/AdminWorksPage.tsx": "Admin page listing works with controls to upload, publish/unpublish, and delete items using admin mutations.",
  "frontend/src/pages/admin/AdminWorkUploadPage.tsx": "Admin page for uploading a new work file with progress tracking, metadata inputs, and admin access checks.",
  "frontend/src/pages/EntryDetailPage.tsx": "Displays a single entry with title, date, tags, and HTML body, using routing and query state handling.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with links to main content sections and a styled hero background.",
  "frontend/src/pages/IntroductionPage.tsx": "Presents an introduction page about the author and their literary focus and works.",
  "frontend/src/pages/SearchPage.tsx": "Implements a search UI allowing users to query entries with optional section filtering and displays results with loading and error states.",
  "frontend/src/pages/SectionListPage.tsx": "Shows published entries for a given section with tag filtering, loading/error handling, and a list view.",
  "frontend/src/pages/WorkDetailPage.tsx": "Displays details for a single work, including metadata and an embedded PDF viewer with download support.",
  "frontend/src/pages/WorksListPage.tsx": "Lists all published works with metadata and provides view or download actions depending on file type.",
  "frontend/src/utils/authErrorMessages.ts": "Normalizes authorization errors into friendly admin-access messages and provides a helper to format error texts.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL or hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, fonts, radius, shadows, and animations for the project.",
  "project_state.json": "Project metadata describing goals, architecture notes, and known issues around admin authorization and work uploads."
}