{
  "kind": "build_request",
  "title": "Fix recurring admin denial when publishing Works (PDF/documents)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Persist Access Control (admin) state across canister upgrades so that admins do not lose publish permissions after deployments, and publishing Works (PDF/documents) is not denied again for previously-authorized admins.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Please as admin give me access to publish my works in form pdf or documents because it is denied again to publish"
        ]
      },
      "acceptanceCriteria": [
        "After an authenticated admin successfully initializes admin access once, subsequent canister upgrades do not revoke admin permissions.",
        "Calling the Works publish/unpublish API as an authenticated admin succeeds after an upgrade without requiring re-initialization via secret token (unless explicitly revoked).",
        "If admin permissions are not present, the backend returns a clear Unauthorized error (no silent failures).",
        "A conditional state migration is added if required to preserve existing access-control/admin state during upgrade."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add an admin-only backend query API to list all Works (published + drafts) so the admin UI can see and publish drafts reliably.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Please as admin give me access to publish my works in form pdf or documents because it is denied again to publish"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns all Works for admins only.",
        "Non-admin callers receive an Unauthorized error when calling this method.",
        "Returned Works include both published=false and published=true items."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update the Admin Works UI data fetching to use the admin-only “list all works” API (not the public published-only list) so admins can always view drafts and publish/unpublish them without being blocked by missing items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Please as admin give me access to publish my works in form pdf or documents because it is denied again to publish"
        ]
      },
      "acceptanceCriteria": [
        "The Admin Works page lists both Draft and Published works for an authenticated admin.",
        "From the Admin Works page, toggling Publish/Unpublish succeeds for an authenticated admin and the UI updates to reflect the new status.",
        "The public Works page continues to show only published works (no regression).",
        "If a publish action fails due to authorization, the UI displays an English error message with a clear next step (e.g., log in with the correct admin account / admin token link if required)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Create backend/migration.mo only if needed to preserve existing state across upgrades (conditional migration policy).",
    "Do not modify any frontend files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding new file types beyond the existing Works upload capability.",
    "Implementing third-party authentication (only Internet Identity is supported).",
    "Changing the public Works browsing experience beyond ensuring only published items are shown."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}