{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Works: fetch drafts via admin-only list-all API and improve auth error feedback",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Update Admin Works UI data fetching to use the admin-only list-all-works backend capability so admins can see drafts and publish/unpublish reliably, while keeping public Works list published-only.",
      "acceptanceCriteria": [
        "The Admin Works page lists both Draft and Published works for an authenticated admin.",
        "From the Admin Works page, toggling Publish/Unpublish succeeds for an authenticated admin and the UI updates to reflect the new status.",
        "The public Works page continues to show only published works (no regression).",
        "If a publish action fails due to authorization, the UI displays an English error message with a clear next step (e.g., log in with the correct admin account / admin token link if required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queryKeys.ts",
          "operation": "modify",
          "description": "Adjust React Query keys to distinguish admin-only 'all works' data from public published-only works, preventing cache collisions (e.g., add an admin-scoped works key used only by the Admin Works screen)."
        },
        {
          "path": "frontend/src/hooks/useAdminWorks.ts",
          "operation": "modify",
          "description": "Update the admin Works query hook to call the admin-only backend capability to list all works (drafts + published) instead of the public published-only list; update related cache invalidations to use the new admin-scoped query key; keep existing toast/error handling so authorization failures surface as clear English guidance. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminWorksPage.tsx",
          "operation": "modify",
          "description": "Update Admin Works page copy/empty-state messaging to reflect that it manages both drafts and published works; ensure it continues to render Draft/Published badges correctly and relies on the updated admin-only works query hook."
        },
        {
          "path": "frontend/src/pages/WorksListPage.tsx",
          "operation": "modify",
          "description": "Regression check: ensure the public Works list continues to use published-only data hooks/query keys and is unaffected by the admin-only 'all works' caching changes (no behavior change intended)."
        }
      ]
    }
  ]
}